#include <locale.h>
#include "tui.h"

const menu_t MAIN_MENU = {
    L"   Начать работу    ",
    L"    О программе     ",
    L" Выйти из программы ",
    NULL
};

/************************************************************************************
 * Перечисление дополнительны функций, которые должны быть здесь просто потому что. *
 ************************************************************************************/

/*
 * Нарисовать задний фон для заданного окна.
 */
void draw_win_background (WINDOW *);